In [2]:
import pandas as ps
val1 = {'Name':['Gowrish','Suresh'],
        'Age':[23,24]
       }
dataFrame1 = ps.DataFrame(val1)
dataFrame1

      Name  Age
0  Gowrish   23
1   Suresh   24

In [16]:
val2 = {'Name':['sankar','kumar'],
        'Age':[23,24]        
       }
dataFrame2 = ps.DataFrame(val2)
dataFrame2

     Name  Age
0  sankar   23
1   kumar   24

In [17]:
#Concat
Concated = ps.concat([dataFrame1,dataFrame2]) #Concate 2 data frames
Concated

      Name  Age
0  Gowrish   23
1   Suresh   24
0   sankar   23
1    kumar   24

In [18]:
#Concat with ignore_index
Concated = ps.concat([dataFrame1,dataFrame2],ignore_index=True) 
Concated

      Name  Age
0  Gowrish   23
1   Suresh   24
2   sankar   23
3    kumar   24

In [19]:
#Concat with keys
Concated = ps.concat([dataFrame1,dataFrame2],keys=['chennai','bangalore']) 
#keys use for create subset for dataFrame
Concated

                Name  Age
chennai   0  Gowrish   23
          1   Suresh   24
bangalore 0   sankar   23
          1    kumar   24

In [24]:
print(Concated.loc['chennai'])
print('----------------------------')
print(Concated.loc['bangalore'])

      Name  Age
0  Gowrish   23
1   Suresh   24
----------------------------
     Name  Age
0  sankar   23
1   kumar   24

In [39]:
#mismatch Column size
val3 = {'Name':['Suresh','Gowrish'],
        'Job':['infoview','zoho']
       }
dataFrame3 = ps.DataFrame(val3,index=[0,1])
dataFrame3

      Name       Job
0   Suresh  infoview
1  Gowrish      zoho

In [41]:
val4 = {'Name':['Gowrish','Suresh'],
        'Age':[23,24]
       }
dataFrame4 = ps.DataFrame(val4,index=[1,0])
dataFrame4

      Name  Age
1  Gowrish   23
0   Suresh   24

In [31]:
ConcatVal = ps.concat([dataFrame3,dataFrame4]) #Concate 2 data frames
ConcatVal

C:\Users\Gowrish\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    Age       Job     Name
0   NaN  infoview   Suresh
1   NaN      zoho  Gowrish
0  23.0       NaN  Gowrish
1  24.0       NaN   Suresh

In [42]:
#axis = 0 means,it will add automatically second data frame as row (Default value is 0)
#axis = 1 means,it will add automatically second data frame as column
#more than it will throw error
ConcatVal = ps.concat([dataFrame3,dataFrame4],axis=1) #Concate 2 data frames
ConcatVal

      Name       Job     Name  Age
0   Suresh  infoview   Suresh   24
1  Gowrish      zoho  Gowrish   23

In [44]:
#To add column using series
seriesVal = ps.Series(['Salem','Coimbatore'],name='City')
seriesVal

0         Salem
1    Coimbatore
Name: City, dtype: object

In [45]:
#Append series into data Frame
ConcatSeries = ps.concat([ConcatVal,seriesVal],axis=1) #Concate 2 data frames
ConcatSeries

      Name       Job     Name  Age        City
0   Suresh  infoview   Suresh   24       Salem
1  Gowrish      zoho  Gowrish   23  Coimbatore